Revit 2026 API

# TemperatureRating Properties

---

The TemperatureRating type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Temperature Rating id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Temperature Rating name. |

#### Reference

TemperatureRating Class

Autodesk.Revit.DB.Electrical Namespace